# This is a sample Python script.
# ==================================================================================================
# import using_name
# using_name.print_hi()
# # Получение списка атрибутов (функций, классов, переменных) текущего модуля
# print(dir())
#
#
# def print_hi():
#     if __name__ == '__main__':
#         print('Эта программа запущена сама по себе. Меня зовут ' + __name__)
#     else:
#         print('Меня портировали в другой модуль. Меня зовут ' + __name__)
#
#
# print_hi()
# ==================================================================================================
# import sys
#
# print('Аргументы командной строки: ')
# for i in sys.argv:
#     print(i)
#
# print('\n\nПеременная PythonPATH содержит', sys.path, '\n')
# ==================================================================================================
# import os
# print(os.__name__, 'Путь файла:', os.getcwd())
#
# print(__name__)
# ==================================================================================================
# import my_module
# print(dir(my_module))
# my_module.sayhi()
# print(my_module.__version__)
# ==================================================================================================
import back_up_ver1
